package practise

import io.kotest.matchers.shouldBe
import org.junit.jupiter.params.ParameterizedTest
import org.junit.jupiter.params.provider.*

class HelperKtTest {

    /*
    * Як правило, варто об'єднувати позитивні та негативні тестові сценарії в одному методі тільки тоді,
    * коли за вхідними параметрами можна легко визначити, який сценарій чому відповідає.
    * В іншому разі негативні та позитивні тестові сценарії слід розділити.
    * А якщо поведінка стає занадто складною, взагалі не використовуйте параметризовані тести.
    * У такому разі кожен негативний і позитивний тестовий сценарій краще описати окремим тестом.
    */

    /*
     * todo написати параметризовані тести для функцій з класу Helper.kt, при реалізації використати наступні аннотації:
     * - @CsvSource
     * - @CsvFileSource
     * - @MethodSource (для передачі параметра у функцію створіть і передавайте data class, замість стандартного класу Arguments)
     * - @ValueSource
     * - EmptyOrNullSource
     */

}
